package chap06.exercises.exercise1_11;

public class Exercise1_11 {
/*
 * 		1.3)하나의 클래스로 여러개의 객체를 만들수 있다.
 * 		2.4)클래스는 field constructor method로 구성  //member == field + method
 * 		3.4)클래스는 반드시 필드와 메소드를 가질 필요는 없다.
 * 		4.3)필드가 먼저 메소드보다 먼저 선언될 필요는 없다.
 * 		5.1)객체를 생성하려면 생성자를 호출해야 한다.
 * 		단 배열을 만들 떄는 생성자를 사용하진 않는다.
 * 		6.4)메소드의 이름은 같아도 매개변수가 다르거나 리턴타입이 다르다면 같은 이름을 가질 수 있다.
 * 		7.2)매개변수의 수나 타입 순서가 달라도 가능하다.
 * 		8.2)정적 멤버에서는 인스턴트 멤버에 접근할 수 없다
 * 		9.2) static final 은 생성자에서 초기화 될 수 없다.
 * 		10.4) 동작하지 않는다.
 * 		11.3)패키지가 같은곳에서는 사용할 수 있다.
 * 
 * */
}
